load-testing/my-reports/feed-run2-ff-on.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: feed.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 2m30s max duration (incl. graceful stop):
              * feed: 100 looping VUs for 2m0s (gracefulStop: 30s)


running (0m01.0s), 100/100 VUs, 777 complete and 0 interrupted iterations
feed   [   1% ] 100 VUs  0m01.0s/2m0s

running (0m02.0s), 100/100 VUs, 1732 complete and 0 interrupted iterations
feed   [   2% ] 100 VUs  0m02.0s/2m0s

running (0m03.0s), 100/100 VUs, 2683 complete and 0 interrupted iterations
feed   [   2% ] 100 VUs  0m03.0s/2m0s

running (0m04.0s), 100/100 VUs, 3638 complete and 0 interrupted iterations
feed   [   3% ] 100 VUs  0m04.0s/2m0s

running (0m05.0s), 100/100 VUs, 4583 complete and 0 interrupted iterations
feed   [   4% ] 100 VUs  0m05.0s/2m0s

running (0m06.0s), 100/100 VUs, 5544 complete and 0 interrupted iterations
feed   [   5% ] 100 VUs  0m06.0s/2m0s

running (0m07.0s), 100/100 VUs, 6502 complete and 0 interrupted iterations
feed   [   6% ] 100 VUs  0m07.0s/2m0s

running (0m08.0s), 100/100 VUs, 7444 complete and 0 interrupted iterations
feed   [   7% ] 100 VUs  0m08.0s/2m0s

running (0m09.0s), 100/100 VUs, 8390 complete and 0 interrupted iterations
feed   [   7% ] 100 VUs  0m09.0s/2m0s

running (0m10.0s), 100/100 VUs, 9344 complete and 0 interrupted iterations
feed   [   8% ] 100 VUs  0m10.0s/2m0s

running (0m11.0s), 100/100 VUs, 10322 complete and 0 interrupted iterations
feed   [   9% ] 100 VUs  0m11.0s/2m0s

running (0m12.0s), 100/100 VUs, 11244 complete and 0 interrupted iterations
feed   [  10% ] 100 VUs  0m12.0s/2m0s

running (0m13.0s), 100/100 VUs, 12207 complete and 0 interrupted iterations
feed   [  11% ] 100 VUs  0m13.0s/2m0s

running (0m14.0s), 100/100 VUs, 13144 complete and 0 interrupted iterations
feed   [  12% ] 100 VUs  0m14.0s/2m0s

running (0m15.0s), 100/100 VUs, 14105 complete and 0 interrupted iterations
feed   [  12% ] 100 VUs  0m15.0s/2m0s

running (0m16.0s), 100/100 VUs, 15060 complete and 0 interrupted iterations
feed   [  13% ] 100 VUs  0m16.0s/2m0s

running (0m17.0s), 100/100 VUs, 16010 complete and 0 interrupted iterations
feed   [  14% ] 100 VUs  0m17.0s/2m0s

running (0m18.0s), 100/100 VUs, 16977 complete and 0 interrupted iterations
feed   [  15% ] 100 VUs  0m18.0s/2m0s

running (0m19.0s), 100/100 VUs, 17910 complete and 0 interrupted iterations
feed   [  16% ] 100 VUs  0m19.0s/2m0s

running (0m20.0s), 100/100 VUs, 18838 complete and 0 interrupted iterations
feed   [  17% ] 100 VUs  0m20.0s/2m0s

running (0m21.0s), 100/100 VUs, 19810 complete and 0 interrupted iterations
feed   [  17% ] 100 VUs  0m21.0s/2m0s

running (0m22.0s), 100/100 VUs, 20710 complete and 0 interrupted iterations
feed   [  18% ] 100 VUs  0m22.0s/2m0s

running (0m23.0s), 100/100 VUs, 21647 complete and 0 interrupted iterations
feed   [  19% ] 100 VUs  0m23.0s/2m0s

running (0m24.0s), 100/100 VUs, 22611 complete and 0 interrupted iterations
feed   [  20% ] 100 VUs  0m24.0s/2m0s

running (0m25.0s), 100/100 VUs, 23511 complete and 0 interrupted iterations
feed   [  21% ] 100 VUs  0m25.0s/2m0s

running (0m26.0s), 100/100 VUs, 24492 complete and 0 interrupted iterations
feed   [  22% ] 100 VUs  0m26.0s/2m0s

running (0m27.0s), 100/100 VUs, 25415 complete and 0 interrupted iterations
feed   [  22% ] 100 VUs  0m27.0s/2m0s

running (0m28.0s), 100/100 VUs, 26360 complete and 0 interrupted iterations
feed   [  23% ] 100 VUs  0m28.0s/2m0s

running (0m29.0s), 100/100 VUs, 27321 complete and 0 interrupted iterations
feed   [  24% ] 100 VUs  0m29.0s/2m0s

running (0m30.0s), 100/100 VUs, 28269 complete and 0 interrupted iterations
feed   [  25% ] 100 VUs  0m30.0s/2m0s

running (0m31.0s), 100/100 VUs, 29221 complete and 0 interrupted iterations
feed   [  26% ] 100 VUs  0m31.0s/2m0s

running (0m32.0s), 100/100 VUs, 30121 complete and 0 interrupted iterations
feed   [  27% ] 100 VUs  0m32.0s/2m0s

running (0m33.0s), 100/100 VUs, 31031 complete and 0 interrupted iterations
feed   [  27% ] 100 VUs  0m33.0s/2m0s

running (0m34.0s), 100/100 VUs, 31969 complete and 0 interrupted iterations
feed   [  28% ] 100 VUs  0m34.0s/2m0s

running (0m35.0s), 100/100 VUs, 32931 complete and 0 interrupted iterations
feed   [  29% ] 100 VUs  0m35.0s/2m0s

running (0m36.0s), 100/100 VUs, 33851 complete and 0 interrupted iterations
feed   [  30% ] 100 VUs  0m36.0s/2m0s

running (0m37.0s), 100/100 VUs, 34831 complete and 0 interrupted iterations
feed   [  31% ] 100 VUs  0m37.0s/2m0s

running (0m38.0s), 100/100 VUs, 35751 complete and 0 interrupted iterations
feed   [  32% ] 100 VUs  0m38.0s/2m0s

running (0m39.0s), 100/100 VUs, 36652 complete and 0 interrupted iterations
feed   [  32% ] 100 VUs  0m39.0s/2m0s

running (0m40.0s), 100/100 VUs, 37586 complete and 0 interrupted iterations
feed   [  33% ] 100 VUs  0m40.0s/2m0s

running (0m41.0s), 100/100 VUs, 38556 complete and 0 interrupted iterations
feed   [  34% ] 100 VUs  0m41.0s/2m0s

running (0m42.0s), 100/100 VUs, 39496 complete and 0 interrupted iterations
feed   [  35% ] 100 VUs  0m42.0s/2m0s

running (0m43.0s), 100/100 VUs, 40463 complete and 0 interrupted iterations
feed   [  36% ] 100 VUs  0m43.0s/2m0s

running (0m44.0s), 100/100 VUs, 41366 complete and 0 interrupted iterations
feed   [  37% ] 100 VUs  0m44.0s/2m0s

running (0m45.0s), 100/100 VUs, 42314 complete and 0 interrupted iterations
feed   [  37% ] 100 VUs  0m45.0s/2m0s

running (0m46.0s), 100/100 VUs, 43266 complete and 0 interrupted iterations
feed   [  38% ] 100 VUs  0m46.0s/2m0s

running (0m47.0s), 100/100 VUs, 44193 complete and 0 interrupted iterations
feed   [  39% ] 100 VUs  0m47.0s/2m0s

running (0m48.0s), 100/100 VUs, 45158 complete and 0 interrupted iterations
feed   [  40% ] 100 VUs  0m48.0s/2m0s

running (0m49.0s), 100/100 VUs, 46068 complete and 0 interrupted iterations
feed   [  41% ] 100 VUs  0m49.0s/2m0s

running (0m50.0s), 100/100 VUs, 47046 complete and 0 interrupted iterations
feed   [  42% ] 100 VUs  0m50.0s/2m0s

running (0m51.0s), 100/100 VUs, 47968 complete and 0 interrupted iterations
feed   [  42% ] 100 VUs  0m51.0s/2m0s

running (0m52.0s), 100/100 VUs, 48931 complete and 0 interrupted iterations
feed   [  43% ] 100 VUs  0m52.0s/2m0s

running (0m53.0s), 100/100 VUs, 49868 complete and 0 interrupted iterations
feed   [  44% ] 100 VUs  0m53.0s/2m0s

running (0m54.0s), 100/100 VUs, 50783 complete and 0 interrupted iterations
feed   [  45% ] 100 VUs  0m54.0s/2m0s

running (0m55.0s), 100/100 VUs, 51768 complete and 0 interrupted iterations
feed   [  46% ] 100 VUs  0m55.0s/2m0s

running (0m56.0s), 100/100 VUs, 52693 complete and 0 interrupted iterations
feed   [  47% ] 100 VUs  0m56.0s/2m0s

running (0m57.0s), 100/100 VUs, 53651 complete and 0 interrupted iterations
feed   [  47% ] 100 VUs  0m57.0s/2m0s

running (0m58.0s), 100/100 VUs, 54593 complete and 0 interrupted iterations
feed   [  48% ] 100 VUs  0m58.0s/2m0s

running (0m59.0s), 100/100 VUs, 55493 complete and 0 interrupted iterations
feed   [  49% ] 100 VUs  0m59.0s/2m0s

running (1m00.0s), 100/100 VUs, 56432 complete and 0 interrupted iterations
feed   [  50% ] 100 VUs  1m00.0s/2m0s

running (1m01.0s), 100/100 VUs, 57393 complete and 0 interrupted iterations
feed   [  51% ] 100 VUs  1m01.0s/2m0s

running (1m02.0s), 100/100 VUs, 58319 complete and 0 interrupted iterations
feed   [  52% ] 100 VUs  1m02.0s/2m0s

running (1m03.0s), 100/100 VUs, 59297 complete and 0 interrupted iterations
feed   [  52% ] 100 VUs  1m03.0s/2m0s

running (1m04.0s), 100/100 VUs, 60198 complete and 0 interrupted iterations
feed   [  53% ] 100 VUs  1m04.0s/2m0s

running (1m05.0s), 100/100 VUs, 61123 complete and 0 interrupted iterations
feed   [  54% ] 100 VUs  1m05.0s/2m0s

running (1m06.0s), 100/100 VUs, 62104 complete and 0 interrupted iterations
feed   [  55% ] 100 VUs  1m06.0s/2m0s

running (1m07.0s), 100/100 VUs, 63004 complete and 0 interrupted iterations
feed   [  56% ] 100 VUs  1m07.0s/2m0s

running (1m08.0s), 100/100 VUs, 63947 complete and 0 interrupted iterations
feed   [  57% ] 100 VUs  1m08.0s/2m0s

running (1m09.0s), 100/100 VUs, 64858 complete and 0 interrupted iterations
feed   [  57% ] 100 VUs  1m09.0s/2m0s

running (1m10.0s), 100/100 VUs, 65808 complete and 0 interrupted iterations
feed   [  58% ] 100 VUs  1m10.0s/2m0s

running (1m11.0s), 100/100 VUs, 66785 complete and 0 interrupted iterations
feed   [  59% ] 100 VUs  1m11.0s/2m0s

running (1m12.0s), 100/100 VUs, 67686 complete and 0 interrupted iterations
feed   [  60% ] 100 VUs  1m12.0s/2m0s

running (1m13.0s), 100/100 VUs, 68625 complete and 0 interrupted iterations
feed   [  61% ] 100 VUs  1m13.0s/2m0s

running (1m14.0s), 100/100 VUs, 69586 complete and 0 interrupted iterations
feed   [  62% ] 100 VUs  1m14.0s/2m0s

running (1m15.0s), 100/100 VUs, 70525 complete and 0 interrupted iterations
feed   [  62% ] 100 VUs  1m15.0s/2m0s

running (1m16.0s), 100/100 VUs, 71488 complete and 0 interrupted iterations
feed   [  63% ] 100 VUs  1m16.0s/2m0s

running (1m17.0s), 100/100 VUs, 72425 complete and 0 interrupted iterations
feed   [  64% ] 100 VUs  1m17.0s/2m0s

running (1m18.0s), 100/100 VUs, 73370 complete and 0 interrupted iterations
feed   [  65% ] 100 VUs  1m18.0s/2m0s

running (1m19.0s), 100/100 VUs, 74327 complete and 0 interrupted iterations
feed   [  66% ] 100 VUs  1m19.0s/2m0s

running (1m20.0s), 100/100 VUs, 75253 complete and 0 interrupted iterations
feed   [  67% ] 100 VUs  1m20.0s/2m0s

running (1m21.0s), 100/100 VUs, 76228 complete and 0 interrupted iterations
feed   [  67% ] 100 VUs  1m21.0s/2m0s

running (1m22.0s), 100/100 VUs, 77137 complete and 0 interrupted iterations
feed   [  68% ] 100 VUs  1m22.0s/2m0s

running (1m23.0s), 100/100 VUs, 78037 complete and 0 interrupted iterations
feed   [  69% ] 100 VUs  1m23.0s/2m0s

running (1m24.0s), 100/100 VUs, 78977 complete and 0 interrupted iterations
feed   [  70% ] 100 VUs  1m24.0s/2m0s

running (1m25.0s), 100/100 VUs, 79938 complete and 0 interrupted iterations
feed   [  71% ] 100 VUs  1m25.0s/2m0s

running (1m26.0s), 100/100 VUs, 80854 complete and 0 interrupted iterations
feed   [  72% ] 100 VUs  1m26.0s/2m0s

running (1m27.0s), 100/100 VUs, 81838 complete and 0 interrupted iterations
feed   [  72% ] 100 VUs  1m27.0s/2m0s

running (1m28.0s), 100/100 VUs, 82739 complete and 0 interrupted iterations
feed   [  73% ] 100 VUs  1m28.0s/2m0s

running (1m29.0s), 100/100 VUs, 83738 complete and 0 interrupted iterations
feed   [  74% ] 100 VUs  1m29.0s/2m0s

running (1m30.0s), 100/100 VUs, 84641 complete and 0 interrupted iterations
feed   [  75% ] 100 VUs  1m30.0s/2m0s

running (1m31.0s), 100/100 VUs, 85563 complete and 0 interrupted iterations
feed   [  76% ] 100 VUs  1m31.0s/2m0s

running (1m32.0s), 100/100 VUs, 86547 complete and 0 interrupted iterations
feed   [  77% ] 100 VUs  1m32.0s/2m0s

running (1m33.0s), 100/100 VUs, 87486 complete and 0 interrupted iterations
feed   [  77% ] 100 VUs  1m33.0s/2m0s

running (1m34.0s), 100/100 VUs, 88447 complete and 0 interrupted iterations
feed   [  78% ] 100 VUs  1m34.0s/2m0s

running (1m35.0s), 100/100 VUs, 89363 complete and 0 interrupted iterations
feed   [  79% ] 100 VUs  1m35.0s/2m0s

running (1m36.0s), 100/100 VUs, 90289 complete and 0 interrupted iterations
feed   [  80% ] 100 VUs  1m36.0s/2m0s

running (1m37.0s), 100/100 VUs, 91266 complete and 0 interrupted iterations
feed   [  81% ] 100 VUs  1m37.0s/2m0s

running (1m38.0s), 100/100 VUs, 92187 complete and 0 interrupted iterations
feed   [  82% ] 100 VUs  1m38.0s/2m0s

running (1m39.0s), 100/100 VUs, 93167 complete and 0 interrupted iterations
feed   [  82% ] 100 VUs  1m39.0s/2m0s

running (1m40.0s), 100/100 VUs, 94087 complete and 0 interrupted iterations
feed   [  83% ] 100 VUs  1m40.0s/2m0s

running (1m41.0s), 100/100 VUs, 95059 complete and 0 interrupted iterations
feed   [  84% ] 100 VUs  1m41.0s/2m0s

running (1m42.0s), 100/100 VUs, 95990 complete and 0 interrupted iterations
feed   [  85% ] 100 VUs  1m42.0s/2m0s

running (1m43.0s), 100/100 VUs, 96945 complete and 0 interrupted iterations
feed   [  86% ] 100 VUs  1m43.0s/2m0s

running (1m44.0s), 100/100 VUs, 97890 complete and 0 interrupted iterations
feed   [  87% ] 100 VUs  1m44.0s/2m0s

running (1m45.0s), 100/100 VUs, 98790 complete and 0 interrupted iterations
feed   [  87% ] 100 VUs  1m45.0s/2m0s

running (1m46.0s), 100/100 VUs, 99716 complete and 0 interrupted iterations
feed   [  88% ] 100 VUs  1m46.0s/2m0s

running (1m47.0s), 100/100 VUs, 100701 complete and 0 interrupted iterations
feed   [  89% ] 100 VUs  1m47.0s/2m0s

running (1m48.0s), 100/100 VUs, 101601 complete and 0 interrupted iterations
feed   [  90% ] 100 VUs  1m48.0s/2m0s

running (1m49.0s), 100/100 VUs, 102583 complete and 0 interrupted iterations
feed   [  91% ] 100 VUs  1m49.0s/2m0s

running (1m50.0s), 100/100 VUs, 103501 complete and 0 interrupted iterations
feed   [  92% ] 100 VUs  1m50.0s/2m0s

running (1m51.0s), 100/100 VUs, 104433 complete and 0 interrupted iterations
feed   [  92% ] 100 VUs  1m51.0s/2m0s

running (1m52.0s), 100/100 VUs, 105401 complete and 0 interrupted iterations
feed   [  93% ] 100 VUs  1m52.0s/2m0s

running (1m53.0s), 100/100 VUs, 106322 complete and 0 interrupted iterations
feed   [  94% ] 100 VUs  1m53.0s/2m0s

running (1m54.0s), 100/100 VUs, 107263 complete and 0 interrupted iterations
feed   [  95% ] 100 VUs  1m54.0s/2m0s

running (1m55.0s), 100/100 VUs, 108222 complete and 0 interrupted iterations
feed   [  96% ] 100 VUs  1m55.0s/2m0s

running (1m56.0s), 100/100 VUs, 109177 complete and 0 interrupted iterations
feed   [  97% ] 100 VUs  1m56.0s/2m0s

running (1m57.0s), 100/100 VUs, 110139 complete and 0 interrupted iterations
feed   [  97% ] 100 VUs  1m57.0s/2m0s

running (1m58.0s), 100/100 VUs, 111084 complete and 0 interrupted iterations
feed   [  98% ] 100 VUs  1m58.0s/2m0s

running (1m59.0s), 100/100 VUs, 112039 complete and 0 interrupted iterations
feed   [  99% ] 100 VUs  1m59.0s/2m0s

running (2m00.0s), 100/100 VUs, 112979 complete and 0 interrupted iterations
feed   [ 100% ] 100 VUs  2m00.0s/2m0s


  █ THRESHOLDS 

    http_req_duration{name:post/feed}
    ✓ 'p(95)<1000' p(95)=10.03ms


  █ TOTAL RESULTS 

    checks_total.......: 226278  1884.126798/s
    checks_succeeded...: 100.00% 226278 out of 226278
    checks_failed......: 0.00%   0 out of 226278

    ✓ feed 200
    ✓ feed has 30-40 posts

    HTTP
    http_req_duration..............: min=503.29µs avg=5.23ms   med=4.49ms  p(90)=8.5ms    p(95)=10.03ms  p(99)=14.95ms max=141.74ms
      { expected_response:true }...: min=503.29µs avg=5.23ms   med=4.49ms  p(90)=8.5ms    p(95)=10.03ms  p(99)=14.95ms max=141.74ms
      { name:post/feed }...........: min=503.29µs avg=5.23ms   med=4.49ms  p(90)=8.5ms    p(95)=10.03ms  p(99)=14.95ms max=141.74ms
    http_req_failed................: 0.00%  0 out of 113139
    http_reqs......................: 113139 942.063399/s

    EXECUTION
    iteration_duration.............: min=100.54ms avg=106.11ms med=105.3ms p(90)=109.73ms p(95)=111.53ms p(99)=116.7ms max=257.35ms
    iterations.....................: 113139 942.063399/s
    vus............................: 100    min=100         max=100
    vus_max........................: 100    min=100         max=100

    NETWORK
    data_received..................: 372 MB 3.1 MB/s
    data_sent......................: 37 MB  311 kB/s



running (2m00.1s), 000/100 VUs, 113139 complete and 0 interrupted iterations
feed ✓ [ 100% ] 100 VUs  2m0s